app/controllers/home_controller.rb

  def proverb
    @proverb = Proverb.find_by(id: rand(1..7))
---
SELECT "proverbs".* FROM "proverbs" WHERE "proverbs"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]